
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеПремииСотрудники.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
		|	ВКМ_НачислениеПремииСотрудники.СуммаПремии КАК СуммаПремии,
		|	ВКМ_НачислениеПремииСотрудники.НДФЛ КАК НДФЛ
		|ИЗ
		|	Документ.ВКМ_НачислениеПремии.Сотрудники КАК ВКМ_НачислениеПремииСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеПремииСотрудники.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеПремииСотрудники.Ссылка = &Ссылка
		|	И ВКМ_НачислениеПремииСотрудники.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();  
		Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.СуммаПоОкладу = ВыборкаДетальныеЗаписи.Оклад;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаПремии;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);

		
		Если ВыборкаДетальныеЗаписи.СуммаПремии > 0 Тогда
			ДвижениеВР = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВР.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВР.Период = Дата;
			ДвижениеВР.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			ДвижениеВР.Сумма = ВыборкаДетальныеЗаписи.СуммаПремии - ВыборкаДетальныеЗаписи.НДФЛ;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();    
	РассчитатьНДФЛ();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	
	Если Не ЗначениеЗаполнено(НДФЛ) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не установлен размер НДФЛ. Расчет удержаний не будет выполнен");
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ДополнительныеНачисления.Сумма) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		Если Выборка.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаНДФЛ = Окр(Выборка.Сумма * НДФЛ / 100, 2);
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ; 
		Движение.Сотрудник = Выборка.Сотрудник; 
		Движение.Сумма = СуммаНДФЛ; 
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
	КонецЦикла;	
	
КонецПроцедуры


