
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	ВКМ_НачислениеПремииСотрудники.СуммаПремии КАК СуммаПремии,
		|	ВКМ_НачислениеПремииСотрудники.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ВКМ_НачислениеПремии.Сотрудники КАК ВКМ_НачислениеПремииСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_НачислениеПремииСотрудники.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеПремииСотрудники.Ссылка = &Ссылка
		|	И ВКМ_НачислениеПремииСотрудники.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	//Сотрудник = Новый Массив;
	//Сотрудник.Добавить("Сотрудник");
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();  
		//Движение = Движения.ВКМ_ДополнительныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		
		Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.СуммаПоОкладу = ВыборкаДетальныеЗаписи.Оклад;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаПремии;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры



