
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	СформироватьДвижения();

	//РассчитатьПремию();
	
КонецПроцедуры

Процедура СформироватьДвижения()
	
	СформироватьДвиженияПоОкладу();
	//СформироватьДвиженияДополнительныеНачисления();
		
КонецПроцедуры

 Процедура СформироватьДвиженияПоОкладу()

	 Движения.ВКМ_ОсновныеНачисления.Очистить();  
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник.Оклад КАК СотрудникОклад,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		 |	ВКМ_НачислениеЗарплатыНачисления.Оклад КАК Оклад
		 |ИЗ
		 |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		 |ГДЕ
		 |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		 Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();  
		 Движение.ПериодРегистрации = Дата;
		 Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
		 Движение.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.ДатаНачала;
		 Движение.БазовыйПериодКонец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		 Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		 Движение.СуммаПоОкладу = ВыборкаДетальныеЗаписи.СотрудникОклад;
	 КонецЦикла;	
	 
	 Движения.ВКМ_ОсновныеНачисления.Записать();  
		
КонецПроцедуры

//  Процедура РассчитатьОклад ()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
//		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
//		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
//		|ИЗ
//		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
//		|			ВидРасчета = &Оклад
//		|				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		Движение = Движения.ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
//		Движение.Результат = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
//		Движение.ОтработаноЧасов = ВыборкаДетальныеЗаписи.Факт;
//		
//		Если Движение.Сторно Тогда
//			
//			Движение.Результат = Движение.Результат;
//			Движение.ОтработаноЧасов = -Движение.ОтработаноЧасов;
//			
//		КонецЕсли;	
//		
//	КонецЦикла;
//	
//    Движения.ОсновныеНачисления.Записать(, Истина);
//	
//КонецПроцедуры


Процедура РассчитатьНДФЛ()
	
	//НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	//
	//Если Не ЗначениеЗаполнено(НДФЛ) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не установлен размер НДФЛ. Расчет удержаний не будет выполнен";
	//	Сообщение.Сообщить();
	//	Возврат;
	//	
	//КонецЕсли;      
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	//	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	//	|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма
	//	|ИЗ
	//	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВКМ_ДополнительныеНачисления.НомерСтроки,
	//	|	ВКМ_ДополнительныеНачисления.Сотрудник,
	//	|	ВКМ_ДополнительныеНачисления.Сумма
	//	|ИЗ
	//	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры




