
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	СформироватьДвижения();

	//РассчитатьПремию();
	
КонецПроцедуры

Процедура СформироватьДвижения()
	
	СформироватьДвиженияПоОкладу();
	//СформироватьДвиженияДополнительныеНачисления();
		
КонецПроцедуры

 Процедура СформироватьДвиженияПоОкладу()

	 Движения.ВКМ_ОсновныеНачисления.Очистить();  
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник.Оклад КАК СотрудникОклад,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		 |	ВКМ_НачислениеЗарплатыНачисления.Оклад КАК Оклад
		 |ИЗ
		 |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		 |ГДЕ
		 |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		 Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();  
		 Движение.ПериодРегистрации = Дата;
		 Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
		 Движение.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.ДатаНачала;
		 Движение.БазовыйПериодКонец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		 Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		 Движение.СуммаПоОкладу = ВыборкаДетальныеЗаписи.СотрудникОклад;
	 КонецЦикла;	
	 
	 Движения.ВКМ_ОсновныеНачисления.Записать();  
		
КонецПроцедуры


//Процедура РассчитатьОклад ()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
//		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
//		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
//		|ИЗ
//		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
//		|			ВидРасчета = &Оклад
//		|				И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		Движение = Движения.ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
//		Движение.Результат = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.Норма;
//		Движение.ОтработаноЧасов = ВыборкаДетальныеЗаписи.Факт;
//		
//		Если Движение.Сторно Тогда
//			
//			Движение.Результат = Движение.Результат;
//			Движение.ОтработаноЧасов = -Движение.ОтработаноЧасов;
//			
//		КонецЕсли;	
//		
//	КонецЦикла;
//	
//    Движения.ОсновныеНачисления.Записать(, Истина);
//	
//КонецПроцедуры


//Процедура РассчитатьПремию()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
//		|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
//		|	ЕСТЬNULL(СведенияОСотрудникахСрезПоследних.ПроцентПремии, 0) КАК ПроцентПремии
//		|ИЗ
//		|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
//		|			&Измерения,
//		|			&Измерения,
//		|			,
//		|			Регистратор = &Ссылка
//		|				И ВидРасчета = &Премия) КАК ДополнительныеНачисленияБазаОсновныеНачисления
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСотрудниках.СрезПоследних(
//		|				&Период,
//		|				(Сотрудник, Подразделение) В
//		|					(ВЫБРАТЬ
//		|						ДополнительныеНачисления.Сотрудник КАК Сотрудник,
//		|						ДополнительныеНачисления.Подразделение КАК Подразделение
//		|					ИЗ
//		|						РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
//		|					ГДЕ
//		|						ДополнительныеНачисления.Регистратор = &Ссылка
//		|						И ДополнительныеНачисления.ВидРасчета = &Премия)) КАК СведенияОСотрудникахСрезПоследних
//		|		ПО ДополнительныеНачисленияБазаОсновныеНачисления.Сотрудник = СведенияОСотрудникахСрезПоследних.Сотрудник
//		|			И ДополнительныеНачисленияБазаОсновныеНачисления.Подразделение = СведенияОСотрудникахСрезПоследних.Подразделение";
//	
//	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));
//	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ДополнительныеНачисления.Премия);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);

//	Измерения = Новый Массив;
//	Измерения.Добавить("Подразделение");
//	Измерения.Добавить("Сотрудник");
//	Запрос.УстановитьПараметр("Измерения", Измерения);

//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

//		Движение = Движения.ДополнительныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
//		
//		Движение.Результат = ВыборкаДетальныеЗаписи.РезультатБаза * ВыборкаДетальныеЗаписи.ПроцентПремии / 100;
//		Движение.Показатель = ВыборкаДетальныеЗаписи.ПроцентПремии;
//		
//	КонецЦикла;
//	
//	Движения.ДополнительныеНачисления.Записать();

//КонецПроцедуры

