
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	СформироватьДвиженияПоОкладу();
	СформироватьДвиженияПрочиеОсновныеНачисления();
	//РассчитатьЗП();
	//РассчитатьНДФЛ();

КонецПроцедуры

 Процедура СформироватьДвиженияПоОкладу()

	 Движения.ВКМ_ОсновныеНачисления.Очистить();  
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		 |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		 |	ВКМ_НачислениеЗарплатыНачисления.Оклад КАК Оклад,
		 |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник.Оклад КАК СотрудникОклад
		 |ИЗ
		 |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		 |ГДЕ
		 |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		 Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();  
		 Движение.ПериодРегистрации = Дата;
		 Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
		 Движение.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.ДатаНачала;
		 Движение.БазовыйПериодКонец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		 Движение.ПериодДействияНачало = ВыборкаДетальныеЗаписи.ДатаНачала;
		 Движение.ПериодДействияКонец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		 Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		 Движение.СуммаПоОкладу = ВыборкаДетальныеЗаписи.СотрудникОклад;
		 Движение.Сумма = ВыборкаДетальныеЗаписи.СотрудникОклад; 
	 КонецЦикла;	
	 
	 Движения.ВКМ_ОсновныеНачисления.Записать(); 
		
 КонецПроцедуры
 
 Процедура СформироватьДвиженияПрочиеОсновныеНачисления()
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
		 |	СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот,
		 |	ВКМ_Сотрудники.Оклад КАК Оклад
		 |ИЗ
		 |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Запись, ИСТИНА) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		 |		ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_Сотрудники.Ссылка
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник,
		 |	ВКМ_Сотрудники.Оклад";
	 
	 Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Дата));
	 Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Дата));
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл   
		 
		 Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();  
		 Движение.ПериодРегистрации = Дата;
		 Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.ПроцентОтРаботы;
		 Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		 Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		 Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		 Движение.ПериодДействияКонец = КонецМесяца(Дата);
		 Движение.Сотрудник = Выборка.Сотрудник;
		 Движение.СуммаПоОкладу = Выборка.Оклад;
		 Движение.Сумма = Выборка.СуммаКОплатеОборот;
	 КонецЦикла;	
	 
	 Движения.ВКМ_ОсновныеНачисления.Записать();  
	 
 КонецПроцедуры
 
 //Процедура РассчитатьЗП()

 //   Запрос = Новый Запрос;
 //   Запрос.Текст = 
 //   	"ВЫБРАТЬ
 //   	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот,
 //   	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
 //   	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
 //   	|ИЗ
 //   	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
 //   	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Запись, ИСТИНА) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
 //   	|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
 //   	|			И (ВКМ_ОсновныеНачисления.Регистратор = &Ссылка)";
 //   
 //   //Измерения = Новый Массив;				
 //   //Измерения.Добавить("Сотрудник");
 //   //Запрос.УстановитьПараметр("Измерения", Измерения);
 //   Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
 //   Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
 //   Запрос.УстановитьПараметр("Ссылка", Ссылка);
 //   
 //   РезультатЗапроса = Запрос.Выполнить();
 //   
 //   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 //   
 //   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 //   		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки -1];
 //   		ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи,,"НомерСтроки");
 //   	КонецЦикла;  
 //   	
 //   Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
 //   
 //КонецПроцедуры

//Процедура РассчитатьНДФЛ()
//	
//	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
//	
//	Если Не ЗначениеЗаполнено(НДФЛ) Тогда
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Не установлен размер НДФЛ. Расчет удержаний не будет выполнен";
//		Сообщение.Сообщить();
//		Возврат;
//		
//	КонецЕсли;      
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
//		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
//		|	МАКСИМУМ(ВКМ_ОсновныеНачисления.Сумма) КАК Сумма,
//		|	ВКМ_Сотрудники.Оклад КАК Оклад
//		|ИЗ
//		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
//		|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_Сотрудники.Ссылка
//		|ГДЕ
//		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВКМ_ОсновныеНачисления.Сотрудник,
//		|	ВКМ_ОсновныеНачисления.НомерСтроки,
//		|	ВКМ_Сотрудники.Оклад
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ВКМ_ДополнительныеНачисления.НомерСтроки,
//		|	ВКМ_ДополнительныеНачисления.Сотрудник,
//		|	ВКМ_ДополнительныеНачисления.Сумма,
//		|	NULL
//		|ИЗ
//		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
//		|ИТОГИ ПО
//		|	Сотрудник";
//	
//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
//	Результат = Запрос.Выполнить();
//	
//	ВыборкаСотрудник = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Пока ВыборкаСотрудник.Следующий() Цикл
//		
//		Движение = Движения.ВКМ_Удержания.Добавить();
//		Движение.ПериодРегистрации = Дата;
//		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ;
//		ЗаполнитьЗначенияСвойств(Движение,ВыборкаСотрудник);
//		Движение.Сумма = ВыборкаСотрудник.Сумма * НДФЛ / 100; 
//		Движение.СуммаПоОкладу = ВыборкаСотрудник.Оклад;
//		
//		Выборка = ВыборкаСотрудник.Выбрать();
//		
//		Пока Выборка.Следующий() Цикл 
//			
//			Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки -1]; 
//			Движение.Сумма = ВыборкаСотрудник.Сумма * НДФЛ / 100;; 
//			
//		КонецЦикла;	
//	КонецЦикла;	
//	
//	Движения.ВКМ_Удержания.Записать(); 

//КонецПроцедуры







