//Перем ОбъектЗаполнения Экспорт;

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт   
	
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
		Объект.Документ = ВладелецФормы.Объект.Ссылка;
	КонецЕсли; 
	 
    ОбъектЗаполнения = Объект.Документ;
    ЗакрытиеФормы = Новый ОписаниеОповещения
    ("ЗаполнениеПоВыбраннымПараметрам", ЭтаФорма); // Название процедуры, которая будет выполняться после закрытия формы "ЗапросПараметров"
    ЗапросПараметров = ОткрытьФорму("ВнешняяОбработка.ПримерОбработкиТабличнойЧастиСДиалогомПараметров.Форма.ЗапросПараметров",
	                        ,ОбъектЗаполнения,,,,ЗакрытиеФормы);

КонецПроцедуры