
//Функция PingGETPingBots(Запрос) 

//	++Хоменко В.И. 19.08.2026

//	Возврат ВКМ_ТелеграмБот.ПростойУспешныйОтвет();

//	--Хоменко В.И. 19.08.2026 

//КонецФункции

//Функция SendPOSTSend(Запрос)

//	++Хоменко В.И. 19.08.2026

// 	//УстановитьПривилегированныйРежим(Истина); 
//	Попытка
//		Ответ = ВКМ_ТелеграмБот.ПростойУспешныйОтвет();
//		ВызватьИсключение "Тестовая ошибка";
//	Исключение
//		ИнформацияОбОшибке = ИнформацияОбОшибке();
//		Ответ = ВКМ_ТелеграмБот.ОтветОбОшибке(ИнформацияОбОшибке);
//	КонецПопытки;	
//	
//		    
//	Возврат Ответ; 

//	--Хоменко В.И. 19.08.2026

//КонецФункции
