
#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Период) И (Объект.Период.ДатаНачала <> НачалоМесяца(Объект.Период.ДатаНачала)
		Или Объект.Период.ДатаОкончания <> КонецМесяца(Объект.Период.ДатаОкончания)) Тогда 
		
		Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);
		Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаОкончания);
		
		ТекстСообщения = СтрШаблон("Период изменен с %1 по %2",Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Период");		
		
	КонецЕсли;
	
	Объект.ДоговорИРеализация.Очистить(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	
КонецПроцедуры   

#КонецОбласти 

#Область ОбработчикиКомандФормы

//&НаСервере
//Процедура ЗаполнитьНаСервере()

//		  	
//КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период!");
		Возврат;
		
	КонецЕсли; 
	
	// Обпаботка формирует документы только за 1 полный месяц
	Если КонецМесяца(Объект.Период.ДатаНачала) <> КонецМесяца(Объект.Период.ДатаОкончания) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период должен составлять полный месяц!");
		Возврат;
		
	КонецЕсли;   
	
	ТяжелаяОперация = ВыполнитьТяжелуюОперациюНаСервере(); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ТяжелаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	

	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыполнитьТяжелуюОперациюНаСервере()
	
	ТяжелаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "ВКМ_ДлительныеОперации.СозданиеРеализаций", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);

	Возврат ТяжелаяОперация ;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отменено!");
		Возврат;
	КонецЕсли; 
	
	РезультатОбработки  = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	Объект.ДоговорИРеализация.Очистить(); 
	
	Если РезультатОбработки.СозданоДокументов = 0 и РезультатОбработки.НеСозданоДокументов = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("В выбранный период все документы уже созданы!");
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда

	ЗаписатьДанныеДокументов(РезультатОбработки);
	
	ТекстСообщения = СтрШаблон("Для данного периода количество созданных документов обработкой - %1.
	|Количество документов , которые были созданы специалистом ранее - %2. ", 	
	РезультатОбработки.СозданоДокументов,РезультатОбработки.НеСозданоДокументов);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ЗаписатьДанныеДокументов(МассивСпискаДокументов); 
	
	Для Каждого ЭлементМассива Из МассивСпискаДокументов Цикл 
		
		Строка = Объект.ДоговорИРеализация.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ЭлементМассива);
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти 




//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
//	
//    ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов(); 
//	
//	Если ДоговорыКонтрагентов.Количество() > 0 Тогда
//		
//	    Для Каждого Договор Из ДоговорыКонтрагентов Цикл
//	        НоваяСтрока = Объект.Данные.Добавить(); 
//	        НоваяСтрока.Договор = Договор; 
//		КонецЦикла; 
//		
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьДоговорыКонтрагентов()  
//	
//	РеквизитыДоговорКонтрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документы.РеализацияТоваровУслуг, "Контрагент,Договор");  
//	РеквизитКонтрагент = РеквизитыДоговорКонтрагент.Контрагент;
//	РеквизитДоговор = РеквизитыДоговорКонтрагент.Договор;

//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1, %2", РеквизитКонтрагент, РеквизитДоговор));

//Запрос = Новый Запрос;
//Запрос.Текст = 
//"ВЫБРАТЬ
//|    ДоговорыКонтрагентов.Ссылка КАК Договор
//|ИЗ
//|    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//|ГДЕ
//|    НЕ ДоговорыКонтрагентов.ПометкаУдаления"; 
//
//РезультатЗапроса = Запрос.Выполнить(); 
//
//Выборка = РезультатЗапроса.Выбрать();
//
//МассивДоговоров = Новый Массив;  
//
//Пока Выборка.Следующий() Цикл
//    МассивДоговоров.Добавить(Выборка.Договор);
//КонецЦикла;   

//    Возврат РеквизитыДоговорКонтрагент;  
//	
//КонецФункции

//&НаКлиенте
//Процедура СоздатьРеализации(Команда)
//	
//	

//КонецПроцедуры  




////&НаКлиенте
////Процедура РассчитатьЗначение()
////	
//    ДлительнаяОперация = НачатьВыполнениеНаСервере();
//    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
//    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
//    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
//	
//КонецПроцедуры

//&НаСервере
//Функция НачатьВыполнениеНаСервере() 
//	
//    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
//    ВыполняемыйМетод = "ВКМ_МассовоеСозданиеДокументов.СозданиеРеализаций";
//    ПараметрДанные = Объект.Данные.Выгрузить().Выгрузитьколонку("Договор");
//    ПараметрПериод = Объект.Период;
//    Возврат ДлительныеОперации.ВыполнитьФункцию(
//        ПараметрыВыполнения,
//        ВыполняемыйМетод,
//        ПараметрДанные,
//        ПараметрПериод);  
//		
//КонецФункции

//&НаКлиенте
//Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт    
//	
//    Если Результат = Неопределено Тогда
//        Возврат;
//	КонецЕсли;  
//	
//    Если Результат.Статус = "Ошибка" Тогда
//        СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
//        Возврат;
//	КонецЕсли;     
//	
//    СообщениеПользователю = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
//    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);    
//	
//КонецПроцедуры



//&НаСервере
//Процедура ЗаполнитьНаСервере()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
//		|	И РеализацияТоваровУслуг.Дата МЕЖДУ РеализацияТоваровУслуг.Договор.ВКМ_ДатаНачалоДоговора И РеализацияТоваровУслуг.Договор.ВКМ_ДатаОкончанияДоговора
//		|	И РеализацияТоваровУслуг.Проведен = Истина
//		|	И РеализацияТоваровУслуг.ПометкаУдаления = Ложь"; 
//	
//	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
//		НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
//		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
//		НаборЗаписей.Прочитать();
//		
//		Для Каждого Запись Из НаборЗаписей Цикл
//			
//		РеализацияТоваровУслуг = ВыборкаДетальныеЗаписи.РеализацияТоваровУслуг;
//		Если РеализацияТоваровУслуг.ПустаяСсылка() Тогда
//			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//			
//			НовыйДокумент.ВыборкаДетальныеЗаписи.РеализацияТоваровУслуг.ПолучитьОбъект();
//			НовыйДокумент.Дата = ТекущаяДата();
//			НовыйДокумент.Проведен = Истина;
//			НовыйДокумент.Записать();
//			Запись.КоличествоПовторов = Запись.КоличествоПовторов + 1;
//			
//			
//		КонецЕсли;
//		КонецЦикла;
//			
//	КонецЦикла;
//	
//	Пока Выборка.Следующий() Цикл
//        
//ДокументОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
//        
//        ДокументОбъект.ОбработкаЗаполнения(Выборка.Ссылка);
//        
//        Попытка
//            ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//            Сообщить("Создан документ " + ДокументОбъект);
//        Исключение
//            Сообщить("Ошибка при создании с/ф для " + Выборка.Ссылка +"
//            |" + ОписаниеОшибки(), СтатусСообщения.Важное);
//        КонецПопытки;
//    
//КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


//КонецПроцедуры


