
&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда 
		Сообщить("Не заполнен период!"); 
		Возврат;
	КонецЕсли;
	
	ТяжелаяОперация = ВыполнитьТяжелуюОперациюНаСервере(); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ТяжелаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);   
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьТяжелуюОперациюНаСервере()
		
	ТяжелаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "ВКМ_ДлительныеОперации.СозданиеРеализаций");
	
	Возврат  ТяжелаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеТаблицы = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Результат сложной операции: %1", ДанныеТаблицы));
	КонецЕсли;	

КонецПроцедуры



//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
//	
//    ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов(); 
//	
//	Если ДоговорыКонтрагентов.Количество() > 0 Тогда
//		
//	    Для Каждого Договор Из ДоговорыКонтрагентов Цикл
//	        НоваяСтрока = Объект.Данные.Добавить(); 
//	        НоваяСтрока.Договор = Договор; 
//		КонецЦикла; 
//		
//	КонецЕсли; 
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьДоговорыКонтрагентов()  
//	
//	РеквизитыДоговорКонтрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документы.РеализацияТоваровУслуг, "Контрагент,Договор");  
//	РеквизитКонтрагент = РеквизитыДоговорКонтрагент.Контрагент;
//	РеквизитДоговор = РеквизитыДоговорКонтрагент.Договор;

	//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1, %2", РеквизитКонтрагент, РеквизитДоговор));

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|    ДоговорыКонтрагентов.Ссылка КАК Договор
	//|ИЗ
	//|    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|ГДЕ
	//|    НЕ ДоговорыКонтрагентов.ПометкаУдаления"; 
	//
	//РезультатЗапроса = Запрос.Выполнить(); 
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//МассивДоговоров = Новый Массив;  
	//
	//Пока Выборка.Следующий() Цикл
	//    МассивДоговоров.Добавить(Выборка.Договор);
	//КонецЦикла;   
	
//    Возврат РеквизитыДоговорКонтрагент;  
//	
//КонецФункции

//&НаКлиенте
//Процедура СоздатьРеализации(Команда)
//	
//	

//КонецПроцедуры  




////&НаКлиенте
////Процедура РассчитатьЗначение()
////	
//    ДлительнаяОперация = НачатьВыполнениеНаСервере();
//    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
//    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
//    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
//	
//КонецПроцедуры

//&НаСервере
//Функция НачатьВыполнениеНаСервере() 
//	
//    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
//    ВыполняемыйМетод = "ВКМ_МассовоеСозданиеДокументов.СозданиеРеализаций";
//    ПараметрДанные = Объект.Данные.Выгрузить().Выгрузитьколонку("Договор");
//    ПараметрПериод = Объект.Период;
//    Возврат ДлительныеОперации.ВыполнитьФункцию(
//        ПараметрыВыполнения,
//        ВыполняемыйМетод,
//        ПараметрДанные,
//        ПараметрПериод);  
//		
//КонецФункции

//&НаКлиенте
//Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт    
//	
//    Если Результат = Неопределено Тогда
//        Возврат;
//	КонецЕсли;  
//	
//    Если Результат.Статус = "Ошибка" Тогда
//        СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
//        Возврат;
//	КонецЕсли;     
//	
//    СообщениеПользователю = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
//    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);    
//	
//КонецПроцедуры



//&НаСервере
//Процедура ЗаполнитьНаСервере()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
//		|	И РеализацияТоваровУслуг.Дата МЕЖДУ РеализацияТоваровУслуг.Договор.ВКМ_ДатаНачалоДоговора И РеализацияТоваровУслуг.Договор.ВКМ_ДатаОкончанияДоговора
//		|	И РеализацияТоваровУслуг.Проведен = Истина
//		|	И РеализацияТоваровУслуг.ПометкаУдаления = Ложь"; 
//	
//	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
//		НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
//		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
//		НаборЗаписей.Прочитать();
//		
//		Для Каждого Запись Из НаборЗаписей Цикл
//			
//		РеализацияТоваровУслуг = ВыборкаДетальныеЗаписи.РеализацияТоваровУслуг;
//		Если РеализацияТоваровУслуг.ПустаяСсылка() Тогда
//			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//			
//			НовыйДокумент.ВыборкаДетальныеЗаписи.РеализацияТоваровУслуг.ПолучитьОбъект();
//			НовыйДокумент.Дата = ТекущаяДата();
//			НовыйДокумент.Проведен = Истина;
//			НовыйДокумент.Записать();
//			Запись.КоличествоПовторов = Запись.КоличествоПовторов + 1;
//			
//			
//		КонецЕсли;
//		КонецЦикла;
//			
//	КонецЦикла;
//	
//	Пока Выборка.Следующий() Цикл
//        
//ДокументОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
//        
//        ДокументОбъект.ОбработкаЗаполнения(Выборка.Ссылка);
//        
//        Попытка
//            ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//            Сообщить("Создан документ " + ДокументОбъект);
//        Исключение
//            Сообщить("Ошибка при создании с/ф для " + Выборка.Ссылка +"
//            |" + ОписаниеОшибки(), СтатусСообщения.Важное);
//        КонецПопытки;
//    
//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


//КонецПроцедуры


