
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

//Процедура ВКМ_ВыполнитьАвтозаполнение(Элемент, НоваяСтрока) Экспорт
//	
//	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
//	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
//	
//	Если НоменклатураАбонентскаяПлата = Неопределено ИЛИ НоменклатураРаботыСпециалиста = Неопределено Тогда
//		ОбщегоНазначения.СообщитьПользователю("Номенклатура не заполнена!"); 
//	КонецЕсли;
//	
//	Отказ = Истина;
//	
//	Если НоваяСтрока Тогда
//        СтрокаТабличнойЧасти = Элемент.Номенклатура.ТекущиеДанные;
//		СтрокаТабличнойЧасти.Номенклатура =  Константы.ОсновнаяНоменклатурнаяГруппа.Получить();
//    КонецЕсли;
//	
//КонецПроцедуры	


#КонецОбласти

#КонецЕсли