///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы  
	
	
	// ++ Хоменко В.И. 12.08.2026
	
	//ПараметрыСеанса.ТекущийПользователь = Пользователи.ТекущийПользователь(); 
    //Связываем пользователя с сотрудником	
		
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();  
	
	НайденныйСотрудник = Справочники.ВКМ_Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ТекущийПользователь.УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(НайденныйСотрудник) Тогда
		
		НовыйСотрудник = Справочники.ВКМ_Сотрудники.СоздатьЭлемент();
		НовыйСотрудник.Наименование = ТекущийПользователь.ПолноеИмя;
		НовыйСотрудник.ИдентификаторПользователяИБ = ТекущийПользователь.УникальныйИдентификатор;
		НовыйСотрудник.Записать();
		
		НайденныйСотрудник = НовыйСотрудник.Ссылка;
		
	КонецЕсли;	
	
	ПараметрыСеанса.ВКМ_ТекущийСотрудник = НайденныйСотрудник; 
	
	// -- Хоменко В.И. 12.08.2026

	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли