#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверитьНаПроведённыеДокументы(Отказ, Ссылка, Клиент, Договор, Дата);
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|				И ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
	|	И ВКМ_ОбслуживаниеКлиента.Проведен
	|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Дата < ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалоДоговора 
			Или Дата > ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДоговора Тогда
			
			ТекстОшибки = СтрШаблон(
			"Дата действия договора с %1 по %2. Проведение документа невозможно!", 
			ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалоДоговора, 
			ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДоговора);
			Сообщить(ТекстОшибки, СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту 
		* ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроцентОтРабот = ПолучитьПроцентОплаты(Специалист, Дата);
	СтавкаЧаса = Договор.ВКМ_СтоимостьЧасаРаботы;
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * СтавкаЧаса * ПроцентОтРабот / 100;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаПроведённыеДокументы(Отказ, Ссылка, Клиент, Договор, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Проведен
		|	И ВКМ_ОбслуживаниеКлиента.Ссылка <> &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.Клиент = &Клиент
		|	И ВКМ_ОбслуживаниеКлиента.Договор = &Договор
		|	И НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Если Запрос.Выполнить().Выбрать().Следующий() Тогда
		Сообщить("Внимание! За этот месяц уже есть проведённый документ по этому клиенту и договору. Проверьте, реализацию.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПроцентОплаты(Сотрудник, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() 
		И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентОтРабот) Тогда
		Возврат ВыборкаДетальныеЗаписи.ПроцентОтРабот;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаДокумента = '00010101'; 
	
	Если Не ЭтоНовый() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист КАК Специалист,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка.Номер КАК Номер,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист.Представление КАК СпециалистПредставление,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента,
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ДатаДокумента = Выборка.Дата;
			СпециалистИзмененный = Выборка.Специалист; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = "Создан новый документ !";
		Уведомление.Записать();
		
	ИначеЕсли ДатаДокумента <> Дата Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = СтрШаблон("Дата %1 документа номер %2 изменена", Выборка.Дата, Выборка.Номер);
		Уведомление.Записать();
		
	ИначеЕсли СпециалистИзмененный <> Специалист Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = СтрШаблон("Специалист %1 документа номер %2 изменен", Выборка.СпециалистПредставление, Выборка.Номер);
		Уведомление.Записать();
		
	КонецЕсли;  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры
  

	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();	
	
КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли 



