#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Специалист = ПараметрыСеанса.ВКМ_ТекущийСотрудник;
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
			|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
			|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
			|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
			|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
			|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора,
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|			ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
			|				И ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец
			|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
			|ГДЕ
			|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
			|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
			|	И ВКМ_ОбслуживаниеКлиента.Проведен
			|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Период", Дата);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Дата >= ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалоДоговора И Дата <= ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДоговора Тогда
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
			Иначе
				ТекстОшибки = СтрШаблон("Дата действия договора с %1 по %2.Проведение документа невозможно!", ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалоДоговора, ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДоговора);
				
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,, "Документ не создан!");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли; 
			Продолжить;
			
		КонецЦикла;
		
		ПроцентОтРабот = ПолучитьПроцентОплаты(Специалист);
		
		СтавкаЧаса = Договор.ВКМ_СтоимостьЧасаРаботы;
		
		Для Каждого Строка Из ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Специалист;
			Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * СтавкаЧаса * ПроцентОтРабот / 100;
		КонецЦикла;
		
	КонецПроцедуры  
	
	Функция ПолучитьПроцентОплаты(Сотрудник)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентОтРабот) Тогда
				Возврат 0;
			Иначе
				Возврат ВыборкаДетальныеЗаписи.ПроцентОтРабот;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецФункции
	
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		СуммаДокумента = ВыполненныеРаботы.Итог("Сумма");

		
		ДатаДокумента = '00010101'; 
		
		Если Не ЭтоНовый() Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВКМ_ОбслуживаниеКлиента.Ссылка.Дата КАК Дата,
				|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист КАК Специалист,
				|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
				|	ВКМ_ОбслуживаниеКлиента.Ссылка.Номер КАК Номер,
				|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист.Представление КАК СпециалистПредставление,
				|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента,
				|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
				|ГДЕ
				|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
				
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда 
				ДатаДокумента = Выборка.Дата;
				СпециалистИзмененный = Выборка.Специалист; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоНовый() Тогда 
			
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = "Создан новый документ !";
			Уведомление.Записать();
			
		ИначеЕсли ДатаДокумента <> Дата Тогда 
			
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = СтрШаблон("Дата %1 документа номер %2 изменена", Выборка.Дата, Выборка.Номер);
			Уведомление.Записать();
			
		ИначеЕсли СпециалистИзмененный <> Специалист Тогда 
			
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = СтрШаблон("Специалист %1 документа номер %2 изменен", Выборка.СпециалистПредставление, Выборка.Номер);
			Уведомление.Записать();
			
		КонецЕсли;  
		
		Если ОбменДанными.Загрузка Тогда
			Возврат; 
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли

