
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРаботы КАК ДоговорВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты КАК ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВидДоговора = &ВидДоговора
	|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Дата МЕЖДУ ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ДатаНачалоДоговора И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончанияДоговора
	|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ДоговорВКМ_СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаДокумента = '00010101'; 
	
	Если Не ЭтоНовый() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка.Дата КАК Дата,
			|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист КАК Специалист,
			|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
			|	ВКМ_ОбслуживаниеКлиента.Ссылка.Номер КАК Номер,
			|	ВКМ_ОбслуживаниеКлиента.Ссылка.Специалист.Представление КАК СпециалистПредставление,
			|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента,
			|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ДатаДокумента = Выборка.Дата;
			СпециалистИзмененный = Выборка.Специалист; 
			 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = "Создан новый документ !";
		Уведомление.Записать();
		
	ИначеЕсли ДатаДокумента <> Дата Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = СтрШаблон("Дата %1 документа номер %2 изменена", Выборка.Дата, Выборка.Номер);
		Уведомление.Записать();
		
	ИначеЕсли СпециалистИзмененный <> Специалист Тогда 
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = СтрШаблон("Специалист %1 документа номер %2 изменен", Выборка.СпециалистПредставление, Выборка.Номер);
		Уведомление.Записать();
		
	КонецЕсли;  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
		
КонецПроцедуры





