
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьДниОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьДниОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДниОтпуска(СтрокаТЧ)
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
		СтрокаТЧ.ИтогоДнейОтпуска = 0;
		Возврат;
	КонецЕсли;
	
	Если СтрокаТЧ.ДатаОкончания < СтрокаТЧ.ДатаНачала Тогда
		ПоказатьПредупреждение(, "Дата окончания не может быть раньше даты начала.");
		СтрокаТЧ.ИтогоДнейОтпуска = 0;
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.ИтогоДнейОтпуска = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400 + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	АдресХранилища = ПоместитьДанныеВХранилищеНаСервере();
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка); 
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", 
	ПараметрыФормы, 
	ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилищеНаСервере()
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ЕСТЬNULL(ОтпускаСотрудников.ИтогоДнейОтпуска, 0) КАК Дней
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ОтпускаСотрудников
		|ГДЕ
		|	ОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выгрузить();
	
	АдресДанных = ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
	
	Возврат АдресДанных;
    
КонецФункции

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Объект.Год = Формат(ВыбранноеЗначение, "ДФ='ММММ гггг'");
КонецПроцедуры


