Функция СозданиеРеализаций(ДатаНачала, ДатаОкончания) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК КонтрагентДоговора,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбработанныеДокументы = Новый Массив;
	
	Пока  Выборка.Следующий() Цикл
		
		Попытка
			Если ЗначениеЗаполнено(Выборка.Ссылка)  Тогда
				
			ТекущийДокумент = Выборка.Ссылка.ПолучитьОбъект(); 
				
			Строка = ОбработанныеДокументы.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Документ = ТекущийДокумент.Ссылка;
				
			Иначе 
				ТекущийДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();  
				
				ТекущийДокумент.Дата = ДатаОкончания;
				ТекущийДокумент.Договор = Выборка.Договор;
				ТекущийДокумент.Контрагент = Выборка.КонтрагентДоговора; 
				ТекущийДокумент.Организация = Выборка.Организация; 
				ТекущийДокумент.ВКМ_ВыполнитьАвтозаполнение();
			КонецЕсли;   
			
			ТекущийДокумент.Записать();
			ОбработанныеДокументы.Добавить(ТекущийДокумент.Ссылка);  
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка при обработке договора %1 ", Выборка.Договор);
		КонецПопытки;
	КонецЦикла;
	
	Возврат ОбработанныеДокументы; 
	
КонецФункции
			
	
		//	//-- Хоменко В.И. август 2026  
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	//    
	//    ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
	//    НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
	//    НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	//    НаборЗаписей.Прочитать();
	//    Для каждого Запись из НаборЗаписей Цикл
	//        
	//        ДатаПроведения = ДобавитьМесяц(Запись.Дата, Запись.КолВоПовторов);  
	//        Если ДатаПроведения = ТекущаяДата() Тогда
	//            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	//            
	//            
	//            НовыйДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//            НовыйДокумент.Дата = ТекущаяДата();
	//            НовыйДокумент.Проведен = Истина;  
	//            НовыйДокумент.Записать();
	//            Запись.КолВоПовторов = Запись.КолВоПовторов + 1;
	//			
	//            Если Запись.КолВоПовторов > Запись.КолВоМесяцевАренды Тогда  
	//                
	//                ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
	//                НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
	//                НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	//                НаборЗаписей.Записать(); 
	//                
	//            КонецЕсли;
	//        КонецЕсли;
	//    КонецЦикла;
	//    НаборЗаписей.Записать();
	//КонецЦикла; 
	


