
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Зарплата.Очистить();
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ОкладЗаМесяц = ПроцентПремии; 
						
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза,
	|	ЗарплатаБазаЗарплата.ОкладЗаМесяц КАК ОкладЗаМесяц
	|ИЗ
	|	РегистрРасчета.Зарплата.БазаЗарплата(
	|			&Измерения,
	|			&Измерения,
	|			,
	|			Регистратор = &Регистратор
	|				И ВидРасчета = ВидРасчета) КАК ЗарплатаБазаЗарплата";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.НачисленияУдержания.ПремияПроцентом);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);  
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения); 
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
		Движение.Сумма = Выборка.СуммаБаза * Выборка.ОкладЗаМесяц / 100; 
		Сумма = Движение.Сумма;
		
	КонецЦикла;	
	
	Движения.Зарплата.Записать(, Истина);


	
КонецПроцедуры
