//Функция СозданиеРеализаций(ДатаНачала, ДатаОкончания) Экспорт 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
//		|	ДоговорыКонтрагентов.Владелец КАК КонтрагентДоговора,
//		|	ДоговорыКонтрагентов.Организация КАК Организация,
//		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ДатаНачалоДоговора,
//		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
//		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
//		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
//		|ПОМЕСТИТЬ ВТ_ДействующиеДоговора
//		|ИЗ
//		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//		|ГДЕ
//		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
//		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
//		|	РеализацияТоваровУслуг.Договор КАК Договор,
//		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент
//		|ПОМЕСТИТЬ ВТ_СозданныеРеализации
//		|ИЗ
//		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//		|ГДЕ
//		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
//		|	И РеализацияТоваровУслуг.Проведен
//		|	И РеализацияТоваровУслуг.Дата МЕЖДУ РеализацияТоваровУслуг.Договор.ВКМ_ДатаНачалоДоговора И РеализацияТоваровУслуг.Договор.ВКМ_ДатаОкончанияДоговора
//		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТ_ДействующиеДоговора.Договор КАК Договор,
//		|	ВТ_СозданныеРеализации.Реализация КАК Реализация
//		|ИЗ
//		|	ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеРеализации КАК ВТ_СозданныеРеализации
//		|		ПО ВТ_ДействующиеДоговора.Договор = ВТ_СозданныеРеализации.Договор
//		|			И ВТ_ДействующиеДоговора.КонтрагентДоговора = ВТ_СозданныеРеализации.Контрагент
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВТ_ДействующиеДоговора.Договор,
//		|	ВТ_СозданныеРеализации.Реализация";
//	
//	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
//	//Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
//	//Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	СозданоДокументов = 0;
//	НеСозданоДокументов = 0;
//	
//	ДанныеТаблицы = Новый ТаблицаЗначений;
//	ДанныеТаблицы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
//	ДанныеТаблицы.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Попытка 
//			
//		НовыйДокументРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//		НовыйДокументРеализацияТоваровУслуг.Заполнить(Выборка);
//		НовыйДокументРеализацияТоваровУслуг.ВКМ_ВыполнитьАвтозаполнение();
//		
//		
//		//Если НовыйДокументРеализацияТоваровУслуг.СуммаДокумента = 0 Тогда
//		//	ОбщегоНазначения.СообщитьПользователю("Сумма документа не должна быть равна 0");
//		//	Продолжить;
//		//КонецЕсли;
//		
//		//Попытка 
//		
//			Если НовыйДокументРеализацияТоваровУслуг.ПроверитьЗаполнение() Тогда 
//				НовыйДокументРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение); 
//				
//				Если НовыйДокументРеализацияТоваровУслуг.СуммаДокумента = 0 Тогда
//					ОбщегоНазначения.СообщитьПользователю("Сумма документа не должна быть равна 0");
//					Продолжить;
//				КонецЕсли;
//				
//				СозданоДокументов = СозданоДокументов + 1;
//				
//				Строка = ДанныеТаблицы.Добавить();
//				Строка.Договор = Выборка.Договор;
//				Строка.Документ = НовыйДокументРеализацияТоваровУслуг.Ссылка;
//			Иначе
//				ТекстОшибки = СтрШаблон("Документ для контрагента %1 по договору %2 не создан", Выборка.КонтрагентПредставление, Выборка.ДоговорПредставление);
//				
//				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,, "Документ не создан!");
//				ВызватьИсключение ТекстОшибки;
//			КонецЕсли; 
//			
//		Исключение    
//			
//			НеСозданоДокументов = НеСозданоДокументов + 1;
//			ЗаписьЖурналаРегистрации("НедопустимаяОперация", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
//			
//		КонецПопытки; 
//		
//	КонецЦикла;
//	
//	Результат = Новый Структура();
//	Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеТаблицы));
//	Результат.Вставить("СозданоДокументов", СозданоДокументов);
//	Результат.Вставить("НеСозданоДокументов", НеСозданоДокументов);
//	
//	Возврат Результат;
//	
//КонецФункции 
