//Функция СозданиеРеализаций(Данные, Период) Экспорт   
//	//++ Хоменко В.И. август 2026
//	
//	Если Данные.Количество() > 0 Тогда
//		
//        КоличествоСозданныхДокументов = 0; 
//		
//        Для Каждого ДоговорКонтрагента Из Данные Цикл            
//            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();            
//			НовыйДокумент.Дата = Период;
//           // НовыйДокумент.МестоХранения = Справочники._ДемоМестаХранения.НайтиПоКоду("ДМ-000001");
//            
//            Реквизиты = Новый Структура;
//            Реквизиты.Вставить("Договор","Ссылка");
//            Реквизиты.Вставить("Контрагент","Владелец");
//            ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,Реквизиты,Истина);     
//            ЗаполнитьЗначенияСвойств(НовыйДокумент, ЗначенияРеквизитовДоговора);
//                                    
//            Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
//                Возврат Ложь;
//			КонецЕсли; 
//			
//            НовыйДокумент.Записать(); 
//            
//            КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1; 
//			
//			//ДлительныеОперации.СообщитьПрогресс(,"Обработано");
//			
//		КонецЦикла;  
//		
//        Возврат СтрШаблон("Количество созданных документов %1", КоличествоСозданныхДокументов);     
//		
//    КонецЕсли;     
//	
//		//-- Хоменко В.И. август 2026
//	
//КонецФункции 
