


Процедура ОтправитьУведомленияВТелеграмм() Экспорт  
	
	Токен = Константы.ВКМ_ТокенТелеграмБот.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграмм. Сообщение не отправлено!",
		УровеньЖурналаРегистрации.Ошибка,,, "Токен для телеграмм не установлен.");
		Возврат;
	КонецЕсли;
	
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграмм. Сообщение не отправлено!",
		УровеньЖурналаРегистрации.Ошибка,,, "ИдентификаторЧата для телеграмм не установлен.");
		Возврат;
	КонецЕсли; 
	
	Выборка = ПолучитьУведомленияДляОтправки();
	
	Пока Выборка.Следующий() Цикл
		
		Ответ = ОтправитьСообщениеВТелеграмм(Выборка.ТекстСообщения, Токен, ИдентификаторЧата);
		Если Ответ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Ответ.КодСостояния = 200 Тогда
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УведомлениеОбъект.Удалить();
		Иначе
			ОписаниеОшибки = Ответ.ПолучитьТелоКакСтроку();
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграмм. Сообщение не отправлено!",
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьСообщениеВТелеграмм(ТекстСообщения, Токен, ИдентификаторЧата)
	
	Ответ = Неопределено;
	
	Попытка
		
		Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("chat_id", ИдентификаторЧата);
		ДанныеСообщения.Вставить("text", ТекстСообщения); 
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеСообщения);
		СообщениеДляОтправки = ЗаписьJSON.Закрыть(); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		
		АдресURL = СтрШаблон("/bot%1/sendMessage", Токен);
		HTTPЗапрос = Новый HTTPЗапрос(АдресURL, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СообщениеДляОтправки);
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Отправка сообщения в телеграмм.Непредвиденная ошибка.",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьУведомленияДляОтправки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ВКМ_УведомленияБота() Экспорт
	    ОтправитьУведомленияВТелеграмм(); 
КонецПроцедуры

