Процедура СозданиеРеализаций() Экспорт   
	//++ Хоменко В.И. август 2026
	
	//РеквизитыДоговорКонтрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документы.РеализацияТоваровУслуг, "Контрагент,Договор");  
	//РеквизитКонтрагент = РеквизитыДоговорКонтрагент.Контрагент;
	//РеквизитДоговор = РеквизитыДоговорКонтрагент.Договор;
	//
	//Если РеквизитыДоговорКонтрагент.Количество() > 0 Тогда
	//	
	//    КоличествоСозданныхДокументов = 0; 
	//	
	//    Для Каждого ДоговорКонтрагента Из РеквизитыДоговорКонтрагент Цикл            
	//        НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();            
	//		//НовыйДокумент.Дата = ;
	//       // НовыйДокумент.МестоХранения = Справочники._ДемоМестаХранения.НайтиПоКоду("ДМ-000001");
	//        
	//        Реквизиты = Новый Структура;
	//        Реквизиты.Вставить("Договор","Ссылка");
	//        Реквизиты.Вставить("Контрагент","Владелец");
	//        ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,Реквизиты,Истина);     
	//        ЗаполнитьЗначенияСвойств(НовыйДокумент, ЗначенияРеквизитовДоговора);
	//                                
	//        Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
	//            Возврат Ложь;
	//		КонецЕсли; 
	//		
	//        НовыйДокумент.Записать(); 
	//        
	//        КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;  
	//		
	//	КонецЦикла;  
	//	
	//    Возврат СтрШаблон("Количество созданных документов %1", КоличествоСозданныхДокументов);     
	//	
	//КонецЕсли;     
	
		//-- Хоменко В.И. август 2026  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
        
        ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
        НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
        НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
        НаборЗаписей.Прочитать();
        Для каждого Запись из НаборЗаписей Цикл
            
            ДатаПроведения = ДобавитьМесяц(Запись.Дата, Запись.КолВоПовторов);  
            Если ДатаПроведения = ТекущаяДата() Тогда
                НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
                
                
                НовыйДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
                НовыйДокумент.Дата = ТекущаяДата();
                НовыйДокумент.Проведен = Истина;  
                НовыйДокумент.Записать();
                Запись.КолВоПовторов = Запись.КолВоПовторов + 1;
				
                Если Запись.КолВоПовторов > Запись.КолВоМесяцевАренды Тогда  
                    
                    ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
                    НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
                    НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
                    НаборЗаписей.Записать(); 
                    
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        НаборЗаписей.Записать();
    КонецЦикла;
КонецПроцедуры
	
//КонецФункции 
