Функция СозданиеРеализаций(ДатаНачала, ДатаОкончания) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора
		|ПОМЕСТИТЬ ВТ_ДействующиеДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора <= &ДатаОкончания
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	РеализацияТоваровУслуг.Договор КАК ДоговорРеализации,
		|	РеализацияТоваровУслуг.Контрагент КАК КонтрагентРеализация,
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
		|ПОМЕСТИТЬ ВТ_СозданныеРеализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействующиеДоговора.Договор КАК Договор,
		|	ВТ_СозданныеРеализации.Реализация КАК Реализация,
		|	ВТ_ДействующиеДоговора.Контрагент КАК Контрагент,
		|	ВТ_СозданныеРеализации.Организация КАК Организация,
		|	ВТ_СозданныеРеализации.СуммаДокумента КАК СуммаДокумента,
		|	ВТ_ДействующиеДоговора.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
		|	ВТ_ДействующиеДоговора.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора
		|ИЗ
		|	ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеРеализации КАК ВТ_СозданныеРеализации
		|		ПО ВТ_ДействующиеДоговора.Договор = ВТ_СозданныеРеализации.ДоговорРеализации
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействующиеДоговора.Договор,
		|	ВТ_СозданныеРеализации.Реализация,
		|	ВТ_ДействующиеДоговора.Контрагент,
		|	ВТ_СозданныеРеализации.Организация,
		|	ВТ_СозданныеРеализации.СуммаДокумента,
		|	ВТ_ДействующиеДоговора.ВКМ_ДатаНачалоДоговора,
		|	ВТ_ДействующиеДоговора.ВКМ_ДатаОкончанияДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СозданоДокументов = 0;
	НеСозданоДокументов = 0;
	УжеСуществовало = 0;
	
	ДанныеТаблицы = Новый ТаблицаЗначений;
	ДанныеТаблицы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ДанныеТаблицы.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг")); 
	
	Пока Выборка.Следующий() Цикл 
		
		СсылкаДокумента = Неопределено;
		ЭтоНовыйДокумет = Истина;

		Если Выборка.ВКМ_ДатаНачалоДоговора > НачалоДня(ДатаОкончания) 
			Или Выборка.ВКМ_ДатаОкончанияДоговора < НачалоДня(ДатаОкончания) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Пропущен договор: %1 — срок действия договора с %2 по %3 не попадает на дату документа ",
			Выборка.Договор, Формат(Выборка.ВКМ_ДатаНачалоДоговора, "ДЛФ=Д"), Формат(Выборка.ВКМ_ДатаОкончанияДоговора, "ДЛФ=Д"))); 
			НеСозданоДокументов = НеСозданоДокументов + 1;
			Продолжить;
			
		КонецЕсли;			
		
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			// Документ уже существует
			СсылкаДокумента = Выборка.Реализация;
			НовыйДокументРеализацияТоваровУслуг = Выборка.Реализация.ПолучитьОбъект();
			ЭтоНовыйДокумет = Ложь;
		Иначе
			// Создаём новый документ
			НовыйДокументРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокументРеализацияТоваровУслуг.Дата = ДатаОкончания;
			НовыйДокументРеализацияТоваровУслуг.Договор = Выборка.Договор;
			НовыйДокументРеализацияТоваровУслуг.Контрагент = Выборка.Контрагент;
			НовыйДокументРеализацияТоваровУслуг.Организация = Выборка.Договор.Организация;
			НовыйДокументРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
			НовыйДокументРеализацияТоваровУслуг.ВКМ_ВыполнитьАвтозаполнение();  
			НовыйДокументРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		Попытка
			Если Не НовыйДокументРеализацияТоваровУслуг.ПроверитьЗаполнение() Тогда
				ВызватьИсключение "Документ не создан: не прошло проверку заполнения";
			КонецЕсли;
			
			НовыйДокументРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
			
			НовыйДокументРеализацияТоваровУслуг = НовыйДокументРеализацияТоваровУслуг.Ссылка.ПолучитьОбъект();
			
			Если НовыйДокументРеализацияТоваровУслуг.СуммаДокумента = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(
				"Сумма документа не должна быть равна 0: " + Строка(НовыйДокументРеализацияТоваровУслуг.Ссылка));
				НеСозданоДокументов = НеСозданоДокументов + 1;
				Продолжить;
			КонецЕсли;
			
			Если СсылкаДокумента = Неопределено Тогда
				СсылкаДокумента = НовыйДокументРеализацияТоваровУслуг.Ссылка;
			КонецЕсли;
			
			Если ЭтоНовыйДокумет Тогда
				СозданоДокументов = СозданоДокументов + 1;
			Иначе
				УжеСуществовало = УжеСуществовало + 1;
			КонецЕсли;
			Строка = ДанныеТаблицы.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Документ = СсылкаДокумента;
			
		Исключение
			НеСозданоДокументов = НеСозданоДокументов + 1;
			ЗаписьЖурналаРегистрации("НедопустимаяОперация", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Результат = Новый Структура();
	
	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ДанныеТаблицы Цикл
		СтрокаСтруктура = Новый Структура;
		СтрокаСтруктура.Вставить("Договор", СтрокаТЗ.Договор);
		СтрокаСтруктура.Вставить("Документ", СтрокаТЗ.Документ);
		МассивДанных.Добавить(СтрокаСтруктура);
	КонецЦикла;
	
	Результат.Вставить("МассивДоговоровИРеализаций", МассивДанных);
	Результат.Вставить("СозданоДокументов", СозданоДокументов);
	Результат.Вставить("УжеСуществовало", УжеСуществовало);
	Результат.Вставить("НеСозданоДокументов", НеСозданоДокументов);
	
	Возврат Результат;
	
КонецФункции 

