Функция СозданиеРеализаций(ДатаНачала, ДатаОкончания) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК КонтрагентДоговора,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ДатаНачалоДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
		|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.Владелец) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДоговорыКонтрагентов.Ссылка) КАК ДоговорПредставление
		|ПОМЕСТИТЬ ВТ_ДействующиеДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора <= &ДатаОкончания
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_СозданныеРеализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействующиеДоговора.Договор КАК Договор,
		|	ВТ_СозданныеРеализации.Реализация КАК Реализация
		|ИЗ
		|	ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеРеализации КАК ВТ_СозданныеРеализации
		|		ПО ВТ_ДействующиеДоговора.Договор = ВТ_СозданныеРеализации.Договор
		|			И ВТ_ДействующиеДоговора.КонтрагентДоговора = ВТ_СозданныеРеализации.Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействующиеДоговора.Договор,
		|	ВТ_СозданныеРеализации.Реализация";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СозданоДокументов = 0;
	НеСозданоДокументов = 0;
	
	ДанныеТаблицы = Новый ТаблицаЗначений;
	//ДанныеТаблицы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	//ДанныеТаблицы.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг")); 
	ДанныеТаблицы.Колонки.Добавить("Договор", Выборка.Договор);
	ДанныеТаблицы.Колонки.Добавить("Документ", Выборка.Реализация);

	
	Пока Выборка.Следующий() Цикл
		
		Попытка 
			
			//Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			//	НовыйДокументРеализацияТоваровУслуг = Выборка.Реализация.Получить();
			//Иначе	
				
				НовыйДокументРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				НовыйДокументРеализацияТоваровУслуг.Заполнить(Выборка); 
				НовыйДокументРеализацияТоваровУслуг.Дата = ДатаОкончания;
				НовыйДокументРеализацияТоваровУслуг.Договор = Выборка.Договор;
				НовыйДокументРеализацияТоваровУслуг.Контрагент = Выборка.КонтрагентДоговора; 
				НовыйДокументРеализацияТоваровУслуг.Организация = Выборка.Организация; 
				НовыйДокументРеализацияТоваровУслуг.ВКМ_ВыполнитьАвтозаполнение();
				
			//КонецЕсли;
			Если НовыйДокументРеализацияТоваровУслуг.СуммаДокумента = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Сумма документа не должна быть равна 0");
				Продолжить;
			КонецЕсли;
			
			//Попытка 
				
				Если НовыйДокументРеализацияТоваровУслуг.ПроверитьЗаполнение() Тогда 
					НовыйДокументРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение); 
					
					Если НовыйДокументРеализацияТоваровУслуг.СуммаДокумента = 0 Тогда
						ОбщегоНазначения.СообщитьПользователю("Сумма документа не должна быть равна 0");
						Продолжить;
					КонецЕсли;
					
					
					СозданоДокументов = СозданоДокументов + 1;
					
					Строка = ДанныеТаблицы.Добавить();
					Строка.Договор = Выборка.Договор;
					Строка.Документ = НовыйДокументРеализацияТоваровУслуг.Ссылка;
				Иначе
					ТекстОшибки = СтрШаблон("Документ для контрагента %1 по договору %2 не создан", Выборка.КонтрагентПредставление, Выборка.ДоговорПредставление);
					
					ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка,,, "Документ не создан!");
					ВызватьИсключение ТекстОшибки;
				КонецЕсли; 
				
			Исключение    
				
				НеСозданоДокументов = НеСозданоДокументов + 1;
				ЗаписьЖурналаРегистрации("НедопустимаяОперация", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
				
			КонецПопытки; 
			
		КонецЦикла;
		
		Результат = Новый Структура();
		Результат.Вставить("МассивДоговоровИРеализаций", ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеТаблицы));
		Результат.Вставить("СозданоДокументов", СозданоДокументов);
		Результат.Вставить("НеСозданоДокументов", НеСозданоДокументов);
		
		Возврат Результат;
		
	КонецФункции 
	
	//Процедура СозданиеРеализаций() Экспорт   
	//++ Хоменко В.И. август 2026
	
	//РеквизитыДоговорКонтрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документы.РеализацияТоваровУслуг, "Контрагент,Договор");  
	//РеквизитКонтрагент = РеквизитыДоговорКонтрагент.Контрагент;
	//РеквизитДоговор = РеквизитыДоговорКонтрагент.Договор;
	//
	//Если РеквизитыДоговорКонтрагент.Количество() > 0 Тогда
	//	
	//    КоличествоСозданныхДокументов = 0; 
	//	
	//    Для Каждого ДоговорКонтрагента Из РеквизитыДоговорКонтрагент Цикл            
	//        НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();            
	//		//НовыйДокумент.Дата = ;
	//       // НовыйДокумент.МестоХранения = Справочники._ДемоМестаХранения.НайтиПоКоду("ДМ-000001");
	//        
	//        Реквизиты = Новый Структура;
	//        Реквизиты.Вставить("Договор","Ссылка");
	//        Реквизиты.Вставить("Контрагент","Владелец");
	//        ЗначенияРеквизитовДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,Реквизиты,Истина);     
	//        ЗаполнитьЗначенияСвойств(НовыйДокумент, ЗначенияРеквизитовДоговора);
	//                                
	//        Если НЕ НовыйДокумент.ПроверитьЗаполнение() Тогда
	//            Возврат Ложь;
	//		КонецЕсли; 
	//		
	//        НовыйДокумент.Записать(); 
	//        
	//        КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;  
	//		
	//	КонецЦикла;  
	//	
	//    Возврат СтрШаблон("Количество созданных документов %1", КоличествоСозданныхДокументов);     
	//	
	//КонецЕсли;     
	
	//	//-- Хоменко В.И. август 2026  
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	//    
	//    ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
	//    НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
	//    НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	//    НаборЗаписей.Прочитать();
	//    Для каждого Запись из НаборЗаписей Цикл
	//        
	//        ДатаПроведения = ДобавитьМесяц(Запись.Дата, Запись.КолВоПовторов);  
	//        Если ДатаПроведения = ТекущаяДата() Тогда
	//            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	//            
	//            
	//            НовыйДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//            НовыйДокумент.Дата = ТекущаяДата();
	//            НовыйДокумент.Проведен = Истина;  
	//            НовыйДокумент.Записать();
	//            Запись.КолВоПовторов = Запись.КолВоПовторов + 1;
	//			
	//            Если Запись.КолВоПовторов > Запись.КолВоМесяцевАренды Тогда  
	//                
	//                ПериодПовторов = РегистрыСведений.ВКМ_МасовоеСозданиеДокументов;
	//                НаборЗаписей = ПериодПовторов.СоздатьНаборЗаписей();
	//                НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	//                НаборЗаписей.Записать(); 
	//                
	//            КонецЕсли;
	//        КонецЕсли;
	//    КонецЦикла;
	//    НаборЗаписей.Записать();
	//КонецЦикла; 
	
	
	
