
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
		Сообщить("Не заполнен период!"); 
		Возврат;
	КонецЕсли;
	
	//ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов();  
	//
	//Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
	//	
	//	Для Каждого Договор Из ДоговорыКонтрагентов Цикл
	//		НоваяСтрока = Объект.Данные.Добавить(); 
	//		НоваяСтрока.Договор = Договор; 
	//	КонецЦикла;
	//	
	//КонецЕсли;  

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьРеквизитыДокумента();
	ДокументОбъект.Записать();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокумента() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора КАК ВКМ_ДатаНачалоДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ВКМ_ДатаОкончанияДоговора
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = &Ложь
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалоДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора"; 
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);	
	РезультатЗапроса = Запрос.Выполнить();  
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.Данные.Очистить(); 

	МассивДокументов = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВКМ_ДатаНачалоДоговора <= Объект.ДатаНачала И Выборка.ВКМ_ДатаОкончанияДоговора >= Объект.ДатаОкончания Тогда
			МассивДокументов.Добавить(Выборка.Договор);  
		КонецЕсли; 
	КонецЦикла;  

КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеализации(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
		Сообщить("Не заполнен период!"); 
		Возврат;
	КонецЕсли;

	РассчитатьЗначение();
	
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьЗначение() 
	
    ДлительнаяОперация = НачатьВыполнениеНаСервере();
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере()   
	
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
    ВыполняемыйМетод = "ВКМ_ДлительныеОперации.СозданиеРеализаций";
    ПараметрДанные = Объект.Данные.Выгрузить().Выгрузитьколонку("Договор");
	ПараметрПериод = Объект.ДатаОкончания;
    Возврат ДлительныеОперации.ВыполнитьФункцию(
        ПараметрыВыполнения,
        ВыполняемыйМетод,
        ПараметрДанные,
        ПараметрПериод);
		
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт 
	
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	//Если Результат.Статус = "Ошибка" Тогда
	//    СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.Ошибка);
	//    Возврат;
	//КонецЕсли; 
	
	Если Результат.Статус = "Выполнено" Тогда
    //ВывестиРезультат(Результат.АдресРезультата);
    СообщениеПользователю = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);   
	КонецЕсли;
	
КонецПроцедуры

