
&НаКлиенте
Процедура СотрудникиСуммаПремииПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Сотрудники.ТекущиеДанные; 
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите сотрудника.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.СуммаПремии) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните сумму премии.");
		Возврат;
	КонецЕсли; 
	
	НДФЛ = ПолучитьСтавкуНДФЛНаСервере();
	
	СтрокаТЧ.НДФЛ = Окр(СтрокаТЧ.СуммаПремии * НДФЛ / 100, 2);
	СтрокаТЧ.СуммаКВыплате = СтрокаТЧ.СуммаПремии - СтрокаТЧ.НДФЛ;
	
	ПолучитьСтавкуНДФЛНаСервере(); 
	
КонецПроцедуры

 &НаСервере
 Функция ПолучитьСтавкуНДФЛНаСервере() 
	 
	Ставка = Константы.ВКМ_НДФЛ.Получить();
	
	Возврат Ставка; 
	
КонецФункции